Repository: MahmodMahdi/SchoolProjectWithCleanArchitecture.Api
Catalog: SchoolProject.Core/Resources/SharedResources.*.resx
Languages: ar

source: Algorithm is wrong
ar: يوجد خطأ في ألجوريزم التشفير

# BadRequest
source: Request Can't be Understood
ar: هذا الطلب لا يمكن فهمه

# ChangePasswordFailed
source: Change Password Operation Failed
ar: حدث خطأ أثناء تغيير الباسورد

source: Confirm email is done
ar: تم تأكيد الإيميل بنجاح

# Created
source: Created Successfully
ar: تم الإضافة بنجاح

# Deleted
source: Deleted Successfully
ar: تم الحذف بنجاح

# DeletedFailed
source: Deleted Operation Failed
ar: حدث خطأ أثناء عملية الحذف

source: Department Id
ar: رقم القسم

source: Department Manager
ar: رئيس القسم

source: Email
ar: الإيميل

# EmailIsExist
source: Email is already exist
ar: هذا الإيميل موجود بالفعل

source: Email Is Not Exist
ar: هذا الإيميل غير موجود

# EmailNotConfirmed
source: Email is not confirmed
ar: لم يتم تأكيد الإيميل

source: Error in confirm email
ar: حدث خطأ أثناء تأكيد الإيميل

# ErrorInCreateUser
source: Error while create user
ar: حدث خطأ اثناء إضافة هذا المستخدم

source: Failed To Add
ar: فشلت عملية الإضافة

source: Failed to add new claims
ar: حدث خطأ أثناء إضافة صلاحية إستخدام جديدة

source: Failed to add new roles
ar: حدث خطأ أثناء إضافة صلاحية جديدة

source: Failed To Add User
ar: حدث خطأ أثناء إضافة المستخدم

source: Failed to remove old claims
ar: حدث خطأ أثناء حذف صلاحية الإستخدام القديمة

source: Failed to remove old roles
ar: حدث خطأ أثناء حذف الصلاحيات القديمة

source: Failed to update
ar: حدث خطأ أثناء عملية التعديل

source: Failed to update image
ar: حدثت مشكلة أثناء رفع الصورة

source: Failed to update UserClaims
ar: حدث خطأ أثناء تعديل صلاحية الإستخدام للمستخدم

source: Failed to update userRoles
ar: حدث خطأ أثناء عملية تحديث صلاحيات المستخدم

source: Failed to upload image
ar: حدثت مشكلة أثناء رفع الصورة

source: Invalid Code
ar: هذا الكود غير صحيح

# IsExist
source: already Exist
ar: هذا العنصر موجود بالفعل

source: Is not Exist
ar: غير موجود

# MaxLengthIs100
source: Max Length must be Less Than 100 character
ar: عدد الحروف المسموح بها 100 حرف

source: Message
ar: الرسالة

source: Name
ar: الاسم

# NoImage
source: Please Select Image
ar: من فضلك قم بإختيار صورة

# NotEmpty
source: must be Not Empty
ar: لا يمكن ترك العنصر فارغ

# NotFound
source: This Item Is Not Found
ar: هذا العنصر غير متوفر

source: Password
ar: الباسورد

source: Password not correct
ar: الباسورد الذي أدخلته غير صحيح

source: Password Not Equal Confirm Password
ar: تأكيد الباسورد يجب أن يطابق الباسورد

# PhoneExist
source: Phone Is already Exist
ar: رقم الهاتف هذا موجود بالفعل

source: Refresh Token Is Not Found
ar: رمز التنشيط غير موجود

# Required
source: This Field is Required
ar: هذا الحقل مطلوب

# RoleIsUsed
source: This role is already used
ar: هذه الصلاحية مستخدمة بالفعل ولا يمكن حذفها

# RoleNotExist
source: Role is not exist
ar: هذه الصلاحية غير موجودة

# SendEmailFailed
source: Sending Email Failed
ar: حدث خطأ أثناء إرسال الإيميل

# SomeThingGoesWrong
source: Some thing goes wrong , please try again
ar: حدث خطأ غير متوقع من فضلك أعد المحاولة مرة أخرى

# Success
source: Done Successfully
ar: تمت العملية بنجاح

source: Supervisor Id
ar: رقم المشرف

source: Token Is Not Expired
ar: رمز الوصول ليس منتهي

# UnAuthorized
source: You are not Authorized to Access This Resources
ar: لا تمتلك الصلاحية للدخول

# UnprocessableEntity
source: There are Validation Errors Or Syntax Errors
ar: يوجد خطأ في نوع الداتا

# Updated
source: Updated Successfully
ar: تم التعديل بنجاح

# UpdatedFailed
source: Updated Operation Failed
ar: حدث خطأ أثناء عملية التعديل

source: User is not Found
ar: هذا المستخدم غير موجود
